cases/cfd/fluids/lid_driven_cavity_ghia_re1000/solution/case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Re = 1000 lid-driven cavity is steady laminar (the primary vortex is
// stationary; transition to unsteadiness is well above this Re).
// No RAS/LES model, no k / omega / nut fields.
simulationType  laminar;
