cases/cfd/fluids/lid_driven_cavity_ghia_re1000/solution/case/0/p
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

// Kinematic pressure (incompressible). Closed cavity: zeroGradient on all
// walls; a single reference cell is pinned by fvSolution pRefCell/pRefValue.
dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    movingWall
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
