cases/cfd/fluids/lid_driven_cavity_ghia_re1000/solution/case/system/centerline
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      evaluatorSample;
}

type            sets;
libs            ("libsampling.so");
interpolationScheme cellPoint;
setFormat       raw;
fields          (U);
sets
(
    verticalCenterline
    {
        type    uniform;
        axis    y;
        start   (0.5 0.00125 0.05);
        end     (0.5 0.99875 0.05);
        nPoints 400;
    }
);
